############################################################################### сложный способ шифрования пароля

echo 'password_encryption = scram-sha-256' >> /etc/postgresql/12/main/postgresql.conf

######################################################################################################## конфиги

ls /etc/postgresql-common/
ls /etc/postgresql/12/main/

########################################################################################## запуск или перезапуск

pg_ctlcluster 12 main start
systemctl restart postgresql

############################################################################### пароль для пользователя postgres
